tap "caskroom/cask"
tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
# Platform built on V8 to build network applications
brew "node"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Git query language
brew "gitql"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Bash and zsh history suggest box
brew "hstr"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Terminal-based visual file manager
brew "midnight-commander"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# Utility for managing network connections
brew "netcat"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Python dependency management tool
brew "pipenv"
# Python package management tool
brew "poetry"
# Password generator
brew "pwgen"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Cross-shell prompt for astronauts
brew "starship"
# Manipulate and query tags on macOS files
brew "tag"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Sends magic packets to wake up network-devices
brew "wakeonlan"
# Internet file retriever
brew "wget"
# XML command-line utilities
brew "xmlstarlet"
# Tool for managing your YubiKey configuration
brew "ykman"
# General-purpose lossless data-compression library
brew "zlib"

cask "aerial"
# App to build and share containerized applications and microservices
cask "docker"
# Web browser
cask "firefox-developer-edition"
cask "font-fira-code"
cask "font-hack"
cask "font-hack-nerd-font"
# Code font with monospaced ligatures
cask "font-hasklig"
cask "font-monoid"
cask "font-powerline-symbols"
cask "font-source-code-pro-for-powerline"
# GIT client
cask "fork"
# Web browser
cask "google-chrome"
# Web browser
cask "google-chrome-canary"
# Hex editor focussing on speed
cask "hex-fiend"
# Set of CPU, memory, disk, and network monitoring tools
cask "menumeters"
# File manager with a dual-pane interface
cask "mucommander"
# Move and resize windows with ease
cask "spectacle"
# Open-source code editor
cask "visual-studio-code"

mas "1Password 7", id: 1333542190
mas "Amphetamine", id: 937984704
mas "Developer", id: 640199958
mas "Skitch", id: 425955336
mas "Xcode", id: 497799835
mas "The Unarchiver", id: 425424353
