tap "aquasecurity/trivy"
tap "azure/kubelogin"
tap "buo/cask-upgrade"
tap "caskroom/cask"
tap "caskroom/versions"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"


# CLI tool for Alexa Skill Kit
brew "ask-cli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Git query language
brew "gitql"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Open-source video transcoder available for Linux, Mac, and Windows
brew "handbrake"
# Kubernetes package manager
brew "helm"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Tool to move from `docker-compose` to Kubernetes
brew "kompose"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Terminal-based visual file manager
brew "midnight-commander"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# Port scanning utility for large networks
brew "nmap"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Python dependency management tool
brew "pipenv"
# Python package management tool
brew "poetry"
# Password generator
brew "pwgen"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Work with remote images registries
brew "skopeo"
# SOcket CAT: netcat on steroids
brew "socat"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Manipulate and query tags on macOS files
brew "tag"
# Granddaddy of HTML tools, with support for modern standards
brew "tidy-html5"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Sends magic packets to wake up network-devices
brew "wakeonlan"
# Internet file retriever
brew "wget"
# HTTP benchmarking tool
brew "wrk"
# Tool to get information about and install available Xcode versions
brew "xcinfo"
# XML command-line utilities
brew "xmlstarlet"
# Scanner for vulnerabilities in container images, file systems, and Git repositories, as well as for configuration issues
brew "aquasecurity/trivy/trivy"
# A Kubernetes credential (exec) plugin implementing azure authentication
brew "azure/kubelogin/kubelogin"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Password manager that keeps all passwords secure behind one password
# cask "1password"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# Apple TV Aerial screensaver
cask "aerial"
# App to build and share containerized applications and microservices
# cask "docker"
# Draw.io is free online diagram software
cask "drawio"
# Web browser
cask "firefox-developer-edition"
# Monospaced font that includes programming ligatures
cask "font-cascadia-code"
cask "font-fira-code"
cask "font-hack"
cask "font-hack-nerd-font"
# Code font with monospaced ligatures
cask "font-hasklig"
cask "font-meslo-for-powerline"
cask "font-monoid"
cask "font-powerline-symbols"
cask "font-source-code-pro-for-powerline"
# GIT client
cask "fork"
# Free and open-source image editor
# cask "gimp"
# Web browser
# cask "google-chrome"
# Web browser
cask "google-chrome-canary"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Hex editor focussing on speed
cask "hex-fiend"
# Utility to hide menu bar items
cask "hiddenbar"
# Vector graphics editor
# cask "inkscape"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Menu bar calendar
cask "itsycal"
# Open-source screen recorder built with web technology
# cask "kap"
# Display all currently loaded kexts
# cask "kextviewr"
# Tool to show what is persistently installed on the computer
# cask "knockknock"
# Kubernetes IDE
cask "lens"
# Open-source firewall to block unknown outgoing connections
# cask "lulu"
# Provides updates to various Microsoft products
# cask "microsoft-auto-update"
# Web browser
# cask "microsoft-edge"
# Office suite
# cask "microsoft-office"
# cask "minikube"
# File manager with a dual-pane interface
cask "mucommander"
# Markdown-based note-taking app that doesn't suck
cask "notable"
# Monitors computer mic and webcam
# cask "oversight"
# Administration and development platform for PostgreSQL
cask "pgadmin4"
# Collaboration platform for API development
cask "postman"
# Visual database editor for Prisma projects
cask "prisma-studio"
# Display image info and preview unsupported formats in QuickLook
cask "qlimagesize"
# QuickLook generator for Markdown files
cask "qlmarkdown"
cask "qlvideo"
cask "quicklookase"
# Scans, detects, and monitors keyboard taps
# cask "reikey"
# Move and resize windows with ease
cask "spectacle"
# Music streaming service
# cask "spotify"
# System monitor for the menu bar
cask "stats"
# General-purpose text editor
cask "textmate"
# Virtualizer for x86 hardware
# cask "virtualbox"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Network protocol analyzer
cask "wireshark"
# Rancher Desktop
cask "rancher"
# Open-source version of the X.Org X Window System
cask "xquartz"
mas "1Password 7", id: 1333542190
mas "Amphetamine", id: 937984704
mas "CoffeeCup", id: 1415866782
mas "Developer", id: 640199958
mas "Free Ruler", id: 1483172210
# mas "Irvue", id: 1039633667
mas "Playgrounds", id: 1496833156
mas "Skitch", id: 425955336
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
