1password
1password-cli
aerial
bitbar
cheatsheet
docker
dozer
firefox-developer-edition
font-fira-code
font-hack-nerd-font
font-hasklig
font-monoid
font-source-code-pro-for-powerline
fork
gas-mask
gimp
google-chrome
google-chrome-canary
google-cloud-sdk
hex-fiend
inkscape
iterm2
itsycal
kap
lens
microsoft-office
minikube
mono-mdk
mucommander
notable
postman
qlcolorcode
qlimagesize
qlmarkdown
qlstephen
qlvideo
quicklook-json
quicklookase
skitch
skype
skype-for-business
slack
spectacle
spotify
sublime-text
the-unarchiver
virtualbox
visual-studio-code
webpquicklook
xquartz
