font-hack-nerd-font
font-source-code-pro-for-powerline
fork
google-cloud-sdk
kap
minikube
mucommander
qlcolorcode
qlimagesize
qlmarkdown
qlstephen
qlvideo
quicklook-json
quicklookase
virtualbox
webpquicklook
google-chrome
firefox-developer-edition
google-chrome-canary
sublime-text
iterm2
visual-studio-code
bitbar
cheatsheet
spectacle
itsycal
skitch
the-unarchiver
slack
gas-mask
inkscape
gimp